{"24":"$","25":"%","30":"0","536":"* ","177500":"2024","289138":"We provide a safe heaven for securing long term investments within the tranquility of a fully regulated Swiss asset manager. ","295600":"XXXX","-278ecb7c":"—  Our mission","-13e9a16f":" is to empower our clients to achieve their financial goals with confidence and peace of mind","1774fc":"2020","cd026be":"Company Founded","-cba01a8":"Established in 2020 in Geneva, SilverArrow Wealth Management has emerged as a pioneering firm, committed to delivering tailored solutions that prioritize client success and financial well-being.","-5230a9d2":"Get in touch","-2e56dec8":"\"We believe in the power of transparency to build strong, lasting relationships with our clients. That’s why we are committed to providing clear, open communication every step of the way\"","-78e000aa":"Jorge | Founder","3dba0078":"Our Mission","-55658e02":"By embodying our values of trustability, transparency, flexibility, and bespoke solutions, we strive to be your trusted partner in wealth management, guiding you every step of the way on your journey to financial success.","7f8f21f1":"Expertise","71d9110f":" — Wealth Management Models | Strategic Planning | Digital Assets Advisory | Strategic Prime Funds | Funds Management Advisory | Fund Creation Services, Treasurey Management | FX Hedging Advisory | Trade Finance & Funding | Bonds Issuance | Structured Products | Private Asset Funding | Single Stocks Lending..","1774fe":"2022","-441ef72f":"Incorporation of Strategic Prime Trading Fund","-33d7a7ed":"This process ensures the fund's operational efficiency and alignment with investment objectives, promoting robust performance and investor confidence.","1774ff":"2023","-10e37e19":"Registered Financial Advisor in Canada (Alberta Securities Commission)","-482767d4":"This accreditation underscores credibility and trustworthiness of SAWM, ensuring our clients receive informed guidance aligned with their financial goals and regulatory expectations.","399a01ba":"First Expansion Plan","6616427c":"In response to growing demand and our commitment to providing exceptional services, we are excited to announce our first major expansion.","-361a1933":"scroll","76ed2f9f":"— Recognizing","-4041bdfb":" individual needs, our team offers modern tailored solutions.","588acfb3":"Asset Management","4c32891":"TL;DR","-55f8ac4":"By leveraging our extensive network and industry expertise, we facilitate seamless interactions between our clients and banks, brokerage firms, and other financial entities.","-172d50ac":"Wealth Management Models","200d":"‍","-471b121f":"Execution – Only","d6c2012":"Our Execution Only model provides the fundamental services of SAWM. We refrain from offering advisory services under this mandate, placing the full responsibility for portfolio management in the hands of investors.","-268b0327":"Advisory","-48a92a17":"For investors who seek to retain control over their investments while also desiring expert guidance and support for their investment strategy, SAWM offers the Advisory service. We collaborate closely with our clients throughout their investment journey, providing extensive research and expertise to facilitate more informed and sophisticated decision-making and portfolio management.","-6e12e4d4":"Discretionary","-7194668f":"With our Discretionary asset management service, clients entrust the management of their portfolios to the experts at SAWM. Our team diligently monitors the markets on a daily basis, making investment decisions based on each client's risk tolerance and desired returns. This model relieves investors from the burden of day-to-day decision-making, allowing them to remain unburdened by constant communication regarding asset transactions and strategy changes. However, our clients have access to detailed information about trades and executions, ensuring utmost transparency throughout the process.","-27efd5a3":"Strategic Planning","1f02e6fd":"Wealth Pillar","c0b21aa":"Planning for the transfer and organization of significant wealth can be a daunting task, often evoking feelings of apprehension. At SAWM, we approach this challenge with a boutique perspective and family values, instilling confidence in our clients. You can rely on our internal expertise and external resources to navigate this complex terrain. Through prudent wealth planning, we help you anticipate potential challenges and devise solutions to ensure a fair and seamless distribution when the time comes.","1bb15e7e":"Estate Pillar","-290662":"Addressing succession matters involves navigating a landscape that is both important and intricate, blending emotions with rational decision-making. The bond between a banker and their client is often shaped by discussions surrounding this crucial topic. Sometimes extending beyond financial considerations, the personal insights and “friendly” advice of the banker complement the guidance of specialists. SAWM stands beside you every step of the way – before, during, and after this significant transition.","32d9ad7f":"Tax Pillar","-20c1e551":"SAWM collaborates with a network of external representatives specializing in Swiss and international tax matters. These experts provide invaluable insights into your tax obligations, both domestically and internationally, ensuring that your overall wealth management strategy is built on a foundation of efficient tax planning. This tailored approach enables us to assess the tax implications of various transactions, whether it involves investments, asset acquisitions, or changes in residency, empowering you to make informed decisions.roughout the process.","-3ea0e535":"Digital Assets","793ffbff":"By utilizing their services our clients not only can invest and hold crypto currencies but also can utilize from term deposits for their investment. ","-44cbc040":"In addition, many investors show high demand to other yield enhancing investment offering of our partner such as trading structured products Dual Currency Deposits, SharkFin structures and investing in crypto currency funds as well as lending of their crypto assets.","-30bf461":"Through a comprehensive understanding of each client’s unique financial situation and goals, we are able to match them with institutions that offer the most favorable terms, services, and support.","2196e5":"Fund","-14dee069":"SAWM's Strategic Prime Funds offer stability and growth in finance and wealth management for sophisticated investors, emphasizing capital appreciation and risk management.","1a574e4d":"Strategic Prime Funds","4e81ac9e":"At the core of Strategic Prime Funds lies a meticulous selection process that identifies opportunities across various asset classes. Whether it’s equities, fixed income securities, or alternative investments, these funds leverage in-depth market research and analysis to construct well-balanced portfolios. By diversifying across sectors and geographies, Strategic Prime Funds not only aim to maximize returns but also shield investors from market volatility.","-4ee3a32d":"Moreover, Strategic Prime Funds are adept at adapting to ever-changing market conditions and economic cycles. With a nimble investment approach, these funds have the flexibility to seize opportunities as they arise while maintaining a long-term perspective. This agility, coupled with a disciplined risk management framework, ensures that investors can navigate through turbulent times with confidence, knowing that their wealth is in capable hands.","1d3b11ff":"In conclusion, Strategic Prime Funds stand as a testament to the commitment of finance and wealth management companies towards delivering value and stability to their clients. With their strategic focus, rigorous selection process, and adaptability, these funds serve as a cornerstone in building and preserving wealth in an increasingly complex financial landscape.","-49fa73c5":"Institutional Services","a640c8":"SAWM enhances client treasury operations with advanced technology, optimizing efficiency and maximizing cash returns. Our FX Hedging services manage currency risk, and our Trade Finance & Funding solutions optimize trade finance and secure capital for business growth.","698509c0":"Treasury Management","-25cc027":"At Silver Arrow Wealth Management, our Treasury Management services provide clients with comprehensive solutions to optimize their cash flow, liquidity, and risk management strategies. From cash forecasting and liquidity management to optimizing working capital and mitigating financial risks, our team of experts works closely with clients to develop tailored treasury solutions that align with their objectives.","2eca34de":"Trade Finance Advisory & Funding","-704a7a41":"We offer a comprehensive range of trade finance solutions, including letters of credit, trade finance facilities, and supply chain finance, tailored to meet the unique needs of importers, exporters, and distributors.","-408974de":"Our team works closely with clients to structure financing arrangements that optimize cash flow, reduce transaction costs, and mitigate trade-related risks, allowing them to seize new opportunities and expand their global footprint.","1ccb8c8a":"— The next generation","-3d57e290":"  of wealth creation has arrived","28850a7f":"Let’s connect","411462e":"Funds","5a50c314":"Networking","13795b92":"Threema","-4d3cb2df":"Telegram","772ccdb2":"Whatsapp","-6c65a538":"Signal","-65db149a":"WeChat","2479d7":"Mail","4984d4e":"Phone","247ab7":"Maps","-665be56a":"Wealth Management","585238d":"about","2268ff":"Home","6a843eb5":"Digital Assets ","3c2336d":"About","-7f0bfdc6":"Partnering","-64104400":"Contact","23254a0c":"Publication","-4887f9ea":"Best Execution Policy","27ee9":"©  ","-374aa708":"  Silver Arrow SA","79ceadde":"Design","-67104443":"anthonysalamin.ch","58c556a8":"— Create","-5a1e226a":" your claim to future wealth","24af75":"More","35a1d2f0":"We provide full fledged access to global markets through top tier investment banks, helping you structure complex investments with familiar counterparties.","47bce475":"SilverArrow facilitates seamless client interactions with banks, brokerages, and financial entities.","6a6a75ed":"Client Services ","781bf8c7":"Various Control Levels","-35675259":"Wether you wish to maintain full operational control using our Execution-Only model, rely on our Advisory to make investment decisions, or trust our Discretionary strategies, we easily adapt to unique requirements. ","-7b3fdd32":"Customised Approach","-1cc2ed82":"Ranging from real estate investments, asset acquisitions, or changes in residency, we empower clients with our networks and experience to make informed decisions.","-7f660ed":"Additional tailored services","-6805f081":"“The best time to plant a tree was 20 years ago. The second-best time is now.”","7ce24ed":"— Chinese proverb","-40e07c87":"— Time","-68d104f":" is our greatest resource - let’s spend it wisely","-6f6317a":"We create enduring partnerships with ambitious businesses that want to make history, and collaborate with them in the pursuit of that goal.","25b177d1":"Engage in purposeful conversations with a community of experienced investors and family offices.","34fb2d13":"Client Services","4cfb82d":"UHNWI","-3ac2d6dd":"For those who have chosen Switzerland as their hub, Silver Arrow offers a wide range of supporting services, local contacts and off market opportunities.","-5ee1af85":"Family Offices","-297ffe02":"Our network of counterparties possess priceless knowledge and countless business opportunities focused around Swiss private banking and cutting edge fintech products.","-57c5faf6":"Digital Asset Providers","-746f5a77":"We are always open to new partnerships with compliant financial institutions worldwide and continuously develop relationships in the growing digital economy.","-1244017c":"“The secret of business is to know something that nobody else knows.”","-510f9729":"— Aristotle Onassis","62d1d5a1":"— Invest","-6b59c62c":" in modern fundamentals","1ba297b4":"With their intrinsic value focus, fundamental analysis and rigorous selection process, our funds serve as stepping stones in growing wealth in an increasingly complex and uncertain future.","78fc96b6":"Preserve your future purchasing power by combining inflation resistant exposure to well established trends in precious metals mining and the digital economy.","3aecfa01":"Long US Equities","-53901c0f":"Focusing on capturing the fundamental value of well established trends within mining of physical metals and Bitcoin ETF products, our flagship fund has generated returns of over 200% year to date in 2024.","3c0e42f9":"Scarcity Fund","63e25234":"Building on the theme of inflation resistant exposure to physical assets, our upcoming Scarcity fund aims to accumulate a wide range of finite and limited products destined to always appreciate in value: land, physical gold, Bitcoin and fine wine to name a few. ","-262e8e0f":"Direct Redemptions","-2a4127c3":"Direct Redemptions: Convert your paper exposure to real assets - claim physical gold, move Bitcoin to cold storage, purchase cash CHF - we encourage direct asset ownership in all forms.  ","c3dee31":"“An email saying you have gold is not the same as having gold”","3845900e":"— Elon Musk","28a59153":"— Future proof","-1c4d2bed":"  your investments","-14962966":"Engage with our team of experts and early adopters to discover the practical applications of blockchain technology, from ETFs to proprietary on-chain infrastructure.","-6d43f2d5":"Our advisory is comprised of committed blockchain entrepreneurs with a decade of first hand experience in digital assets, adding value at any level of complexity. ","6c1d3423":"Wether you discovered Bitcoin in 2013 or 2023, you will find our advisory to be a competent source of experience for making crucial decisions while investing, building, or trading digital assets.","4fb5cfe0":"Investments","63d04cff":"We understand and respect the fundamental narratives behind blockchain technology and seek to provide the most genuine products to our clients. We also develop bespoke investment products focused on self custody and unitary value accumulation.","-10d509b7":"Private Banking","-49d031d7":"From on/off ramp services, OTC, LTV lines of credit to simple redemptions, we facilitate your banking relationships and ensure your long term goals are accomplished via a variety of asset preserving products aimed at securing your holdings for the next generation.","-343f3595":"“Our favourite hodling period is forever.”","-cae8abd":"— Warren Buffet","75755f50":"Asset ","6582389d":"Management ","9c5f":"(2)","5dd424bd":"Institutional ","6bdf1b62":"Services ","41145db":"Fund ","9c40":"(1)","-c6d8":"Digital ","393694dd":"Assets ","3c9fad0":"Asset","b885463":"Management","5289b84e":"6 topics","-5f8cfd1a":"Get an edge","-7c14e080":"Call us","2d5d45a2":"email us","305d2245":"Find us","2b":"+","-2be474aa":"Annual Fund Performance","8d55":"$1B","54f1439d":"Total AUM","-3d534b2":"Years of Experience with Digital Assets","257574c4":"Obtained FINMA License","4d":"M","-166be069":"Average Account Size","441914cb":"— Trusted","-75a4173c":" by many,","-7c24e591":" proven by numbers","645f0031":"About us","-2b79bd4a":"— Your trusted","-331d8758":" partner","1979b":"in ","6c88b555":"wealth management _","-2222aed2":"— We believe","-294fa0d3":" in the power of transparency to build lasting client relationships","1422dc09":"Discover","3a42146":"We embody trust, transparency, flexibility, and bespoke solutions to be your trusted wealth management partner, guiding you to financial success every step of the way.","2d4fa128":"— Join us","65f8f859":" in shaping the global future of wealth management","df13934":"Join us","684a89d1":"Silver Arrow Wealth Management is a Swiss licensed independent asset management company, serving an international clientele of ultra-high-net-worth individuals, families, corporations and financial institutions. We have adopted the ambassador model across different countries to foster synergies between our ambassadors’ networks and our suite of services.","-725642ba":"We seek high-caliber individuals and organizations as new ambassadors. If this interests you, please get in touch via bizdev@sawm.ch","-8fb26a5":"Button Text","-482a1182":"SilverArrow SA upholds the highest standards of integrity, supported by a robust ecosystem and partnerships granting access to experts, enabling us to deliver extensive wealth management services.","5121de1a":"We facilitate seamless client interactions with banks, brokerages, and financial entities.","-13ad6133":"We offer diverse avenues of capital growth and wealth preservation","c6992d":"— Acknowledging","-25ea30f5":" the specific demands of our clientele, we offer state-of-the-art solutions for wealthy individuals","-5cdd5920":"— You ask,","-4699e6d0":" we answer","-7d8e69f1":"Talk to us","23f4":" —","6838e784":"Our team is happy to provide additional information and support to ensure all your queries are answered.","10ef6":"FAQ","-449c6334":"What does it mean to be FINMA regulated?","-221d2b27":"Being FINMA regulated means that we are supervised by the Swiss Financial Market Supervisory Authority (FINMA), ensuring we adhere to strict standards of transparency, stability, and integrity. This regulation provides our clients with the assurance that their investments are managed within a robust regulatory framework.","7516e7d7":"FINMA regulation impacts our services by requiring us to meet stringent compliance and risk management standards. This means that our investment strategies, customer service, and overall business operations are designed to prioritize client security and financial well-being.","74abee83":"Why is FINMA regulation important for clients?","79d1633b":"FINMA regulation is crucial as it guarantees that we operate under rigorous guidelines designed to protect investors. It also ensures that we maintain high levels of financial stability and ethical business practices, providing our clients with peace of mind and confidence in our services.","-28b4b7f":"Who are your financial counterparties?","5af0b78d":"Our financial counterparties include a network of highly reputable banks, investment firms, and financial institutions. These partners are selected based on their financial strength, reliability, and compliance with regulatory standards.","6649ddf6":"How do you choose your financial counterparties?","14c36caf":"We choose our financial counterparties through a rigorous selection process that evaluates their financial health, regulatory compliance, market reputation, and the quality of services they provide. This ensures that our clients benefit from partnerships with trusted and stable financial institutions.","3611dc4b":"— We value","-730b80af":" developing a close working relationship with our clients","-57d907a7":"— Next Generation","-3af33d28":" Family Office","300c77":"for ","6a8434e7":"Digital Asset _","3dc0e326":"Technological progress meets Swiss precision - Secure, Digital, and Future Proof.","77e020e6":"We are experts in digital assets and traditional finance, providing new alternatives and unique opportunities in regulated frontier markets.","2324fede":"Investment Philosophy","-313800ff":"We believe technology to be the primary driver of change in the world, and position our business at the forefront of digital innovation. We regard simplicity and elegance in financial markets as desirable traits, and deliver a clear understanding of new and complex investments.","-41dfe6c5":"We understand modern economic realities and measure capital preservation in purchasing power. ","-21d51c3d":"We believe in risk, and either invest with conviction or safeguard capital for future opportunities.","-1646cb9d":"Technology Focused","-610bf648":"Our competitive advantage is our unique knowledge of the digital economy, drawing on the decades of experience of our team members and partners.","-2b86eb22":"We conduct deep research into fintech and blockchain applications, resulting in the development of unique financial products and services. ","22a7aac3":"Experienced Team","22b0b4bf":"Our team is comprised of genuine innovators and entrepreneurs with lifelong commitments to their fields - ranging from private banking to the blockchain industry.","-61c33fd8":"Operating in real time, we we act with the same sense of urgency as our partners, using modern communication and often operating outside regular business hours.","1c544dde":"We apply our skills with enthusiasm and have a business culture focused on intelligence, empathy, meritocracy, and international collaboration.","-38b49fe3":"Licences?","-410c0b68":"We are a Geneva based FINMA licensed Swiss asset manager.","-39b8646a":"Access our weekly publications","-19efd6e":"Our Publication section compiles reliable information by aggregating professional reports from curated sources ","32a8763a":"Access now","2fe532":"feat","7635fb4f":"This is some text inside of a div block.","-79d6d8f6":"LOCKED","4bce595a":"Download PDF","3d503d2b":"No items found.","600b95e9":"“Innovation distinguishes between a leader and a follower.”","-25d527b1":"— Steve Jobs","-48852160":"— Stay updated","7c479244":" or stay behind","-776d91ec":"Stay updated","-4c2af897":"In the fast-paced world of finance, staying informed is the key to turning today's insights into tomorrow's gains.","7a3482a7":"In the ever-changing world of finance, staying ahead means turning knowledge into opportunity before the market moves.","4183f7e7":"Publications","-4169ccf6":"locked","45d10ced":"Open the PDF","-17270c63":"“In finance, the only constant is change—adapt, or get left behind.”","-3fb25397":"— A wise man","134c3fd7":"— Success","-538b0751":" in finance belongs to those who adapt quickly"}